/*
 * Alipay.com Inc.
 * Copyright (c) 2004-2005 All Rights Reserved.
 */
package com.alipay.util.httpClient;

/* *
 *ÀàÃû£ºHttpResultType
 *¹¦ÄÜ£º±íÊ¾Http·µ»ØµÄ½á¹û×Ö·û·½Ê½
 *ÏêÏ¸£º±íÊ¾Http·µ»ØµÄ½á¹û×Ö·û·½Ê½
 *°æ±¾£º3.3
 *ÈÕÆÚ£º2012-08-17
 *ËµÃ÷£º
 *ÒÔÏÂ´úÂëÖ»ÊÇÎªÁË·½±ãÉÌ»§²âÊÔ¶øÌá¹©µÄÑùÀý´úÂë£¬ÉÌ»§¿ÉÒÔ¸ù¾Ý×Ô¼ºÍøÕ¾µÄÐèÒª£¬°´ÕÕ¼¼ÊõÎÄµµ±àÐ´,²¢·ÇÒ»¶¨ÒªÊ¹ÓÃ¸Ã´úÂë¡£
 *¸Ã´úÂë½ö¹©Ñ§Ï°ºÍÑÐ¾¿Ö§¸¶±¦½Ó¿ÚÊ¹ÓÃ£¬Ö»ÊÇÌá¹©Ò»¸ö²Î¿¼¡£
 */
public enum HttpResultType {
    /**
     * ×Ö·û´®·½Ê½
     */
    STRING,

    /**
     * ×Ö½ÚÊý×é·½Ê½
     */
    BYTES
}
